//finance .js ไฟล์นี้ไวใช้สำหรับ เก็บตัวแปรหรือฟังคืชั่นที่เกี่ยวข้องกับการคำนวนสินเชือ
const Finance = {
  //ประกาศตัวแปรด้านนอก เพื่อเรียกเช่าใช้งานจากไฟล์อื่น ฟังค์ชั่นได้ไม่ชนกัน ในที่นี้ขอตั้งชื่อว่าเป็นชื่อเดียกับไฟล์
  loan: Vue.ref(0), // ตย.เราสร้างตัวแปร ชื่อ loan และสามารถใช้คุณสมบัติของ vue ได้เลย โดยในที่นี้เราจะใช้ ref เพื่อให้เหมือกับเปลี่ยนแปลงค่านั้นได้เลย

  calculate(balance) {
    // ตย.เรามีฟังค์ชั่น calculate (ไม่ต้องประกาศฟังค์ชั่น เพราะเราได้ประกาศ จากชื่อ Finance ไว้แล้วแปลว่าเราจองค่าไว้แล้วจึงไม่ต้องประากศซ้ำ และสามารถมีพารามีเตอร์รับค่าได้เลย)
    this.loan.value = balance * 0.7; // เข้าถึง ref ด้วย .value เพื่อเปลี่ยนค่า
  },
};
const FinanceLogic = {
  calculateLoan: () => {
    console.log("คำนวณสินเชื่อ...");
  },
};
